# Ejercicios de Pandas

Cree un `DataFrame` con los siguientes datos:

| school_code | class | name | date_Of_Birth | weight | address | t_id |
| ----------- | ----------- | ----------- | ----------- | ----------- | ----------- | ----------- |
| s001      | V | Alberto Franco | 15/05/2002 | 35 | street1 | t1 |
| s002   | V | Gino Mcneill | 17/05/2002 | 32 | street2 | t2 |
| s003 | VI | Ryan Parkes | 16/02/1999 | 33 | street3 | t3 |
| s001 | VI | Eesha Hinton | 25/09/1998 | 30 | street1 | t4 |
| s002 | V | Gino Mcneill | 11/05/2002 | 31 | street2 | t5 |
| s004 | VI | David Parkes | 15/09/1997 | 32 | street4 | t6 |

In [ ]:
# INTEGRANTES DEL GRUPO
#==========================
#  Mateo Vargas Isaza 
# Elizabeth Nicole Linares Camus

In [135]:
import pandas as pd
import numpy as np

In [136]:
school_code=['s001', 's002', 's003', 's001', 's002', 's004']
nclass=['V', 'V', 'VI', 'VI', 'V', 'VI']
name=['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes']
date_of_birth=['15/05/2002', '17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997']
weight=[35, 32, 33, 30, 31, 32]
adress=['street1', 'street2', 'street3', 'street1', 'street2', 'street4']
t_id=['t1', 't2', 't3', 't4', 't5', 't6']

In [137]:
diccionario={'school_code': school_code, 'class': nclass, 'name': name, 'date_Of_birth': date_of_birth, 'weight': weight, 'adress': adress, 't_id':t_id }

In [138]:
datoscol=pd.DataFrame(diccionario)

In [126]:
datoscol

  school_code class            name date_Of_birth  weight   adress t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

1. Escribir un programa de Pandas para mostrar el índice por defecto y establecer una columna como un índice en un `DataFrame` determinado.

In [9]:
datoscol.index

RangeIndex(start=0, stop=6, step=1)

In [40]:
datoscol.set_index('name')

               school_code class date_Of_birth  weight   adress t_id
name
Alberto Franco        s001     V    15/05/2002      35  street1   t1
Gino Mcneill          s002     V    17/05/2002      32  street2   t2
Ryan Parkes           s003    VI    16/02/1999      33  street3   t3
Eesha Hinton          s001    VI    25/09/1998      30  street1   t4
Gino Mcneill          s002     V    11/05/2002      31  street2   t5
David Parkes          s004    VI    15/09/1997      32  street4   t6

2. Escribir un programa de Pandas para crear un `DataFrame` multi-índice usando dos columnas y usando un índice y una columna

In [139]:
datoscol.set_index(['school_code','name']).sort_index()

                           class date_Of_birth  weight   adress t_id
school_code name
s001        Alberto Franco     V    15/05/2002      35  street1   t1
            Eesha Hinton      VI    25/09/1998      30  street1   t4
s002        Gino Mcneill       V    17/05/2002      32  street2   t2
            Gino Mcneill       V    11/05/2002      31  street2   t5
s003        Ryan Parkes       VI    16/02/1999      33  street3   t3
s004        David Parkes      VI    15/09/1997      32  street4   t6

In [ ]:
datoscol.set_index(['name', default])

3. Escribir un programa de Pandas para crear un `DataFrame` y establecer un título o nombre de la columna de índice.

In [65]:
datoscol['Observaciones']=range(0,6)
datoscol2 = datoscol.set_index('Observaciones')

In [66]:
datoscol2

,school_code,class,name,date_Of_birth,weight,adress,t_id
Observaciones,,,,,,,
0,s001,V,Alberto Franco,15/05/2002,35,street1,t1
1,s002,V,Gino Mcneill,17/05/2002,32,street2,t2
2,s003,VI,Ryan Parkes,16/02/1999,33,street3,t3
3,s001,VI,Eesha Hinton,25/09/1998,30,street1,t4
4,s002,V,Gino Mcneill,11/05/2002,31,street2,t5
5,s004,VI,David Parkes,15/09/1997,32,street4,t6

4. Escribir un programa de Pandas para encontrar los índices de las filas de un valor específico de una columna dada en un DataFrame.

In [70]:
np.where(datoscol2.name=='David Parkes')

(array([5], dtype=int64),)

In [72]:
datoscol2.loc[datoscol2.name=='David Parkes']

,school_code,class,name,date_Of_birth,weight,adress,t_id
Observaciones,,,,,,,
5,s004,VI,David Parkes,15/09/1997,32,street4,t6

5. Escribir un programa de Pandas para insertar una columna en un índice específico en un DataFrame dado.

Para esto, use el siguiente `DataFrame` y agregue la columna `date_Of_birth`

```python
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  [1, 2, 3, 4, 5, 6])
```

In [73]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  [1, 2, 3, 4, 5, 6])

In [80]:
df

  school_code class            name  weight
1        s001     V  Alberto Franco      35
2        s002     V    Gino Mcneill      32
3        s003    VI     Ryan Parkes      33
4        s001    VI    Eesha Hinton      30
5        s002     V    Gino Mcneill      31
6        s004    VI    David Parkes      32

In [76]:
df['date_Of_birth']=['15/05/2002', '17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997']

In [81]:
df.insert(2,"date_Of_birth",['15/05/2002', '17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997'],True)

In [82]:
df

  school_code class date_Of_birth            name  weight
1        s001     V    15/05/2002  Alberto Franco      35
2        s002     V    17/05/2002    Gino Mcneill      32
3        s003    VI    16/02/1999     Ryan Parkes      33
4        s001    VI    25/09/1998    Eesha Hinton      30
5        s002     V    11/05/2002    Gino Mcneill      31
6        s004    VI    15/09/1997    David Parkes      32

6. Escribir un programa de Pandas para encontrar el índice entero de filas con los datos que faltan en un `DataFrame` dado.

Use el siguiente `DataFrame`

```python
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
```

In [62]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])

In [72]:
df

   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002    35.0
t2        s002     V    Gino Mcneill    17/05/2002     NaN
t3        s003    VI     Ryan Parkes    16/02/1999    33.0
t4        s001    VI    Eesha Hinton    25/09/1998    30.0
t5        s002     V    Gino Mcneill    11/05/2002    31.0
t6        s004    VI    David Parkes    15/09/1997     NaN

In [73]:
df.columns[df.isnull().any()]

Index(['weight'], dtype='object')

In [76]:
busquedaNan = df[df.isnull().any(1)]

In [77]:
busquedaNan

   school_code class          name date_of_birth  weight
t2        s002     V  Gino Mcneill    17/05/2002     NaN
t6        s004    VI  David Parkes    15/09/1997     NaN

In [78]:
columna=df.columns[df.isnull().any()]
df[columna].isnull().sum()
print(df[df.isnull().any(axis=1)][columna].head())

    weight
t2     NaN
t6     NaN

7. Escribir un programa de Pandas para seleccionar una fila específica de un `DataFrame` dado por el índice entero.

Use el siguiente `DataFrame`

```python
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]})
```

In [3]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]})

In [4]:
df

  school_code class            name date_of_birth  weight
0        s001     V  Alberto Franco    15/05/2002      35
1        s002     V    Gino Mcneill    17/05/2002      32
2        s003    VI     Ryan Parkes    16/02/1999      33
3        s001    VI    Eesha Hinton    25/09/1998      30
4        s002     V    Gino Mcneill    11/05/2002      31
5        s004    VI    David Parkes    15/09/1997      32

In [7]:
df.iloc[[3]]

  school_code class          name date_of_birth  weight
3        s001    VI  Eesha Hinton    25/09/1998      30

8. Escribir un programa de Pandas para convertir los valores continuos de una columna en un `DataFrame` dado a categóricos.

Use el siguiente `DataFrame`

```python
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
      'age': [18, 22, 85, 50, 80, 5]
})
```

Use la columna edad para clasificar de acuerdo a la siguiente regla:

| Grupo | Rango etario |
| ---------- | ----------- |
| kids | < 18 |
| adult | 18 - 65 |
| elderly | > 65 |

In [9]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
      'age': [18, 22, 85, 50, 80, 5]})

In [16]:
df

             name  age
0  Alberto Franco   18
1    Gino Mcneill   22
2     Ryan Parkes   85
3    Eesha Hinton   50
4    Syed Wharton   80
5   Kierra Gentry    5

In [18]:
df

             name  age    grupo
0  Alberto Franco   18    adult
1    Gino Mcneill   22    adult
2     Ryan Parkes   85  elderly
3    Eesha Hinton   50    adult
4    Syed Wharton   80  elderly
5   Kierra Gentry    5      kid

In [17]:
df['grupo']=['adult','adult','elderly','adult','elderly','kid']

In [19]:
df.grupo=pd.Categorical(df.grupo, ['kids', 'adult','elderly'])

In [20]:
df.grupo

0      adult
1      adult
2    elderly
3      adult
4    elderly
5        NaN
Name: grupo, dtype: category
Categories (3, object): ['kids', 'adult', 'elderly']

### Para los ejercicios 9 y 10 use el siguiente `DataFrame`

In [104]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

9. Escriba un programa de Pandas para ordenar el `DataFrame` primero por "name" en orden descendente, y luego por "score" en orden ascendente.

In [105]:
df.sort_values('name', inplace=True, ascending=False)
df

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [106]:
df.sort_values('score', inplace=True, ascending=True)
df

        name  score  attempts qualify
i      Kevin    8.0         2      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes
g    Matthew   14.5         1     yes
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
f    Michael   20.0         3     yes
h      Laura    NaN         1      no
d      James    NaN         3      no

10. Escribir un programa de Pandas para reemplazar la columna "qualify" contiene los valores "yes" y "no" con True y False.

In [107]:
df.replace({"qualify":{'yes':True, "no":False}})

        name  score  attempts  qualify
i      Kevin    8.0         2    False
e      Emily    9.0         2    False
b       Dima    9.0         3    False
a  Anastasia   12.5         1     True
g    Matthew   14.5         1     True
c  Katherine   16.5         2     True
j      Jonas   19.0         1     True
f    Michael   20.0         3     True
h      Laura    NaN         1    False
d      James    NaN         3    False

11. Escribir un programa de Pandas para iterar sobre las filas en un `DataFrame`.

Use el siguiente `DataFrame`

```python
exam_data = [{'name':'Anastasia', 'score':12.5}, 
             {'name':'Dima','score':9}, 
             {'name':'Katherine','score':16.5}]
df = pd.DataFrame(exam_data)
```

In [108]:
exam_data = [{'name':'Anastasia', 'score':12.5}, 
             {'name':'Dima','score':9}, 
             {'name':'Katherine','score':16.5}]
df = pd.DataFrame(exam_data)
for i in range(len(df)) :
    print(df.loc[i, "name"], df.loc[i, "score"])

Anastasia 12.5
Dima 9.0
Katherine 16.5

12. Escribir un programa de Pandas para obtener la representación numérica de una matriz identificando valores distintos de una columna dada de un `DataFrame`.

Use el siguiente `DataFrame`

```python
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
```

In [109]:
df = pd.DataFrame({'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]})
df.values

array([['Alberto Franco', '17/05/2002', 18.5],
       ['Gino Mcneill', '16/02/1999', 21.2],
       ['Ryan Parkes', '25/09/1998', 22.5],
       ['Eesha Hinton', '11/05/2002', 22.0],
       ['Gino Mcneill', '15/09/1997', 23.0]], dtype=object)

13. Escribir un programa de Pandas para eliminar valores infinitos de un `DataFrame` dado.

Use el siguiente `DataFrame`

```python
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
```

In [110]:
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
df.replace([np.inf, -np.inf], np.nan).dropna()

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0

14. Escribe un programa de Pandas para encontrar la fila donde el valor de una columna dada es máximo.

Use el siguiente `DataFrame`

```python
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
```

In [111]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print(df.col1.idxmax())
print(df.col2.idxmax())
print(df.col3.idxmax())

4
3
2

15. Escribe un programa de Pandas para contar los valores de NaN en una o más columnas del `DataFrame`.

Use el siguiente `DataFrame`

```python
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
```

In [113]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [114]:
## para todo el DataFrame
exam_data=pd.DataFrame(data=exam_data)
exam_data.isna().sum().sum()

2

In [115]:
## para solo una columna
print(exam_data['name'].isna().sum())
print(exam_data['score'].isna().sum())
print(exam_data['attempts'].isna().sum())
print(exam_data['qualify'].isna().sum())

0
2
0
0